var mondayTVProgramm = new TVProgramm();
mondayTVProgramm.channels =
    [
        {
            "title": "Первый",
            "image": "images/1_kanal",
            "programms": [
                        {
                            "title": "Телеканал Доброе утро",
                            "time": "8:00",
                            "category": "Досуг",
                            "description": "Утренний информационно-развлекательный телеканал появился в 1986 году."
                        }, 
                        {
                            "title": "Новости",
                            "time": "9:00",
                            "category": "Инфо",
                            "description": "Новости"
                        }, 
                        {
                            "title": "Контрольная закупка",
                            "time": "9:30",
                            "category": "Досуг",
                            "description": "Программа основана на конкурсе товаров с объявлением победителя.  Новые рубрики: Контрольный рейд - основная задача  - узнать, какие продукты продаются на прилавках рынков и магазинов, с какими проблемами сталкивается рядовой покупатель, и научить продавца соблюдать законы."
                        }, 
                        {
                            "title": "Жить здорово!",
                            "time": "10:20",
                            "category": "Досуг",
                            "description": "Жить здорово!"
                        }, 
                        {
                            "title": "Модный приговор",
                            "time": "11:20",
                            "category": "Досуг",
                            "description": "Модный приговор"
                        }, 
                        {
                            "title": "Новости с субтитрами",
                            "time": "13:00",
                            "category": "Инфо",
                            "description": "Новости с субтитрами"
                        }, 
                        {
                            "title": "Время покажет",
                            "time": "15:25",
                            "category": "Досуг",
                            "description": "Время покажет"
                        }, 
                        {
                            "title": "Новости с субтитрами",
                            "time": "17:00",
                            "category": "Инфо",
                            "description": "Новости с субтитрами"
                        }, 
                        {
                            "title": "Время покажет",
                            "time": "18:00",
                            "category": "Досуг",
                            "description": "Время покажет"
                        }, 
                        {
                            "title": "Мужское / Женское",
                            "time": "19:00",
                            "category": "Досуг",
                            "description": "Проект, который попытается помочь мужчинам и женщинам разобраться в их отношениях."
                        }, 
                        {
                            "title": "Наедине со всеми",
                            "time": "20:10",
                            "category": "Досуг",
                            "description": "Программа-интервью с известными людьми."
                        }, 
                        {
                            "title": "Вечерние новости с субтитрами",
                            "time": "21:00",
                            "category": "Инфо",
                            "description": "Вечерние новости с субтитрами"
                        }, {
                            "title": "Давай поженимся!",
                            "time": "21:45",
                            "category": "Досуг",
                            "description": "В новом телевизионном сезоне авторы планируют регулярно знакомить зрителей с парами, которые сложились на их программе. Кто-то из участников пока еще переживает счастливый конфетно-букетный период и бегает на свидания, а кто-то, следуя названию программы, уже побывал в ЗАГСе."
                        }
                    ],
        },
        {
            "title": "Россия 1",
            "image": "images/russia_1",
            "programms": [
                {
                    "title": "Комната смеха",
                    "time": "07:00",
                    "category": "Досуг",
                    "description": "Лучшие монологи, миниатюры и клоунские номера отечественной сатиры. Классика жанра в исполнении Аркадия Райкина, Жванецкого, Семена Альтова и других патриархов. Шедевры из программы \"Вокруг смеха\" и новая волна сатириков."
                },
                {
                    "title": "Следствие ведут знатоки. Дело №21 - \"Без ножа и кастета\", 2-я серия",
                    "time": "08:20",
                    "category": "Сериалы",
                    "description": "Расследуя очередное дело, ЗнаТоКи неожиданно выходят на крупные хищения в обычном ДЭЗе."
                },
                {
                    "title": "Утренняя почта",
                    "time": "08:50",
                    "category": "Досуг",
                    "description": "Артисты разговорного жанра, известные юмористы братья Пономаренко, со свойственными им позитивной энергетикой и оптимистичным взглядом на жизнь приглашают зрителей посмотреть лучшие концертные номера и послушать любимые песни."
                },
                {
                    "title": "Местное время. Вести-Москва. Неделя в городе",
                    "time": "10:20",
                    "category": "Инфо",
                    "description": "Новости, происшествия, репортажи - все, что произошло в столице за неделю."
                },
                {
                    "title": "Позови, и я приду",
                    "time": "13:10",
                    "category": "Фильмы",
                    "description": "Своенравный характер и подростковая страсть приводят главную героиню к печальным последствиям - она слишком рано становится матерью и вынуждена оставить сына в детском доме. Встав на ноги, девушка не может смириться с принятым ранее решением и всеми силами пытается разыскать своего ребенка."
                },
                {
                    "title": "Вести",
                    "time": "14:00",
                    "category": "Инфо",
                    "description": "13 мая 1991 года первым выпуском информационной программы \"Вести\" началась история телеканала \"Россия\". \"Вести\", которые можно смело назвать главной информационной программой страны, всегда являлись визитной карточкой телеканала."
                },
                {
                    "title": "По горячим следам",
                    "time": "15:00",
                    "category": "Сериалы",
                    "description": "В полицию обращается женщина - пропал ее сын, 18-летний Петя. Пропал из больницы, в которую попал несколько часов назад с черепно-мозговой травмой. Врач сказал матери, что, по словам свидетелей, Петя ехал на футбольный матч в компании фанатов и подрался с фанатами команды-соперника..."
                },
                {
                    "title": "Личный интерес",
                    "time": "16:10",
                    "category": "Сериалы",
                    "description": "Татьяна убегает из зоны, она приезжает в глухое село Павловка - в дом своей покойной бабушки. Там она встречает Максима, который приехал в деревню, чтобы отдохнуть от городской суеты. Между ними возникает взаимное чувство."
                }
                ,
                {
                    "title": "Один в один. Битва сезонов",
                    "time": "17:20",
                    "category": "Досуг",
                    "description": "В новом сезоне шоу встречаются победители и финалисты всех предыдущих сезонов! Каждую неделю десять знаменитостей примеряют на себя образ легендарных музыкантов прошлого и настоящего, полностью копируя оригинальный стиль артиста: от манеры двигаться до тембра голоса."
                }
            ]
        },
        {
            "title": "ТВ Центр",
            "image": "images/tvc",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Разрешите тебя поцеловать... На свадьбе",
                    "category": "Фильмы",
                    "description": "Разрешите тебя поцеловать... На свадьбе"
                },
                {
                    "time": "10:05",
                    "title": "Леонид Каневский. Безнадежный счастливчик",
                    "category": "Досуг",
                    "description": "Знаменитому контрабандисту из фильма \"Бриллиантовая рука\", известному актеру и телеведущему Леониду Каневскому 2 мая исполняется 75 лет. Счастливый случай не раз играл в его жизни решающую роль. Но сам он уверен, что случайность хороша лишь тогда, когда умеешь ею воспользоваться, рассмотреть выпавший тебе шанс, не упустить его."
                },
                {
                    "time": "10:55",
                    "title": "Барышня и кулинар",
                    "category": "Досуг",
                    "description": "Кулинарная программа с участием двух постоянных ведущих. Опытный кулинар Михаил Плотников еженедельно дает уроки приготовления вкусной и здоровой пищи своей ученице - Анне Семенович."
                },
                {
                    "time": "11:30",
                    "title": "События",
                    "category": "Инфо",
                    "description": "Основная ежедневная информационная программа канала, посвященная важнейшим общественным, политическим, экономическим и культурным событиям дня в России и за рубежом."
                },
                {
                    "time": "11:45",
                    "title": "Петровка, 38",
                    "category": "Инфо",
                    "description": "Ежедневная телепрограмма, подготовленная телестудией ГУВД Москвы. В программе даётся оперативная сводка происшествий по городу."
                },
                {
                    "time": "13:55",
                    "title": "Смех с доставкой на дом",
                    "category": "Досуг",
                    "description": "Смех с доставкой на дом."
                },
                {
                    "time": "14:30",
                    "title": "Московская неделя",
                    "category": "Сериалы",
                    "description": "Ттележурнал о нашем городе, о людях, которые в нем живут, и о наиболее заметных событиях прошедших семи дней. Все грани столичной жизни: от экономики и градостроительства - до истории, культуры и даже московских тайн."
                },
                {
                    "time": "15:00",
                    "title": "Каменская (Игра на чужом поле)",
                    "category": "Инфо",
                    "description": "Получив отпуск, Настя уезжает в санаторий \"Долина\", где попадает в гущу криминальных событий. В курортном городке работает подпольная киностудия, где снимают странные фильмы с кровавыми сюжетами. А потом начинаются самые что ни на есть реальные убийства."
                }
                ,
                {
                    "time": "17:10",
                    "title": "Марафон для трех граций",
                    "category": "Фильмы",
                    "description": "Встретившись в кафе, подруги Катя, Жанна и Ирина обращают внимание на странную пару за соседним столом: женщина тайно передает мужчине конверт. А несколько минут спустя они видят в туалете на полу того самого мужчину застреленным."
                }
            ]
        },
        {
            "title": "Матч ТВ",
            "image": "images/match_tv",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Ты можешь больше!",
                    "category": "Досуг",
                    "description": "Это не программа про скучный спортзал и строгую диету. Вы научитесь правильно питаться и заниматься зарядкой так, как никто и никогда этого не делал. Образ жизни начинается с мыслей - а они должны быть позитивными! Каждый человек должен начать путь с дивана в активную жизнь. Наши ведущие: Маша Командная, Сергей Кривохарченко, Алексей Михайлов, Ольга Березуцкая, эксперты и гости помогут сделать жизнь лучше, ну или, хотя бы - веселее! Зарядки, вкусные и полезные блюда, правила спорта и мотивирующие истории наших героев - все это - \"Ты можешь больше!\""
                },
                {
                    "time": "10:05",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "10:55",
                    "title": "Футбол. Чемпионат Италии",
                    "category": "Спорт",
                    "description": "Встреча \"Милана\" и \"Ювентуса\" вызывает колоссальный интерес не только в Италии, но и далеко за ее пределами. Миланский клуб пытается вскочить на подножку уходящего поезда и попасть в зону еврокубков. Туринцы же являются лидерами Серии А и стремительными шагами движутся к своему очередному Скудетто. "
                },
                {
                    "time": "12:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                },
                {
                    "time": "14:00",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "14:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                }
                ,
                {
                    "time": "16:50",
                    "title": "Хоккей. Еврочеллендж. Россия - Норвегия",
                    "category": "Спорт",
                    "description": "Европейский хоккейный вызов, также известен как ЕвроЧеллендж — ежегодная серия международных турниров по хоккею с шайбой, проводящаяся с 2001 года. Является своего рода аналогом Еврохоккейтура, в котором принимают участие сборные Первого дивизиона, не входящие в число элитных команд мира, и сборные Второго дивизиона."
                }
            ]
        },
        {
            "title": "Пятница",
            "image": "images/pyatnica",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Вуди Вудпекер",
                    "category": "Детям",
                    "description": "Обновленная версия приключений неутомимого дятла Вуди. Недаром Вуди называют американским дятлом номер один. Песня из мультфильма про этого дятла возглавила хит-парады аж в 48-м году, а его смех до сих пор является фирменной маркой американской мультипликации."
                },
                {
                    "time": "09:05",
                    "title": "Смешарики",
                    "category": "Детям",
                    "description": "На планете Земля существует вымышленная страна, где живут забавные круглые зверушки. Здесь новый день не похож на предыдущий, обитатели чудесного места постоянно придумывают себе захватывающие приключения."
                },
                {
                    "time": "10:05",
                    "title": "Смешарики",
                    "category": "Детям",
                    "description": "На планете Земля существует вымышленная страна, где живут забавные круглые зверушки. Здесь новый день не похож на предыдущий, обитатели чудесного места постоянно придумывают себе захватывающие приключения."
                },
                {
                    "time": "10:55",
                    "title": "Пятница News",
                    "category": "Досуг",
                    "description": "Никакой политики и экономики, только позитивные самые свежие новости из мира российского и зарубежного шоу-бизнеса. Скандалы, редчайшие съемки и абсолютные эксклюзивы."
                },
                {
                    "time": "11:00",
                    "title": "Орел и решка",
                    "category": "Досуг",
                    "description": "Орел и решка"
                },
                {
                    "time": "12:30",
                    "title": "Блокбастеры!",
                    "category": "Досуг",
                    "description": "Андрей Бедняков и Настя Короткая приглашают вас в невероятное путешествие по местам любимых фильмов. Оказавшись в роли известных киногероев, они повторят их маршруты, узнают секреты съемок и покажут, что изменилось с тех пор, как в этих местах прозвучала команда Стоп, снято!"
                },
                {
                    "time": "14:00",
                    "title": "Орел и решка. Кругосветка",
                    "category": "Досуг",
                    "description": "Регина Тодоренко и Леся Никитюк отправляются в самое захватывающее путешествие - в кругосветку. Две блондинки, девять месяцев непрерывного путешествия и миллион всего, ради чего стоит путешествовать."
                },
                {
                    "time": "15:30",
                    "title": "Поймай меня, если сможешь",
                    "category": "Фильмы",
                    "description": "Фрэнк Эбэгнейл успел поработать врачом, адвокатом и пилотом на пассажирской авиалинии – и все это до достижения полного совершеннолетия в 21 год. Мастер в обмане и жульничестве, он также обладал искусством подделки документов, что в конечном счете принесло ему миллионы долларов, которые он получил по фальшивым чекам."
                }
                ,
                {
                    "time": "17:50",
                    "title": "Аферисты в сетях",
                    "category": "Досуг",
                    "description": "Вероятно, многие из нас становились невольными жертвами изощренных мошенников - аферистов. Вы никогда не определите в том или ином человеке профессионального афериста, ведь мастерски провернутая афера - это своего рода искусство."
                }
            ]
        }
    ];

var tuesdayTVProgramm = new TVProgramm();
tuesdayTVProgramm.channels =
    [
        {
            "title": "Первый",
            "image": "images/1_kanal",
            "programms": [
                        {
                            "title": "Армейский магазин",
                            "time": "08:10",
                            "category": "Досуг",
                            "description": "\"Армейский магазин\" - одна из самых популярных информационно-развлекательных программ на отечественном телевидении вот уже 12 лет. Такая популярность объясняется, прежде всего тем, что программа рассчитана на широкую зрительскую аудиторию – от семей военнослужащих, до действительных и потенциальных призывников и их родных и близких."
                        },
                        {
                            "title": "Смешарики. Пин-код",
                            "time": "09:35",
                            "category": "Детям",
                            "description": "Веселые уроки по выходным. Непобедимая команда снова с нами. Легко и просто о самых сложных вещах."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "11:00",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Фазенда. Космос в гостиной",
                            "time": "10:50",
                            "category": "Досуг",
                            "description": "Идею проекта подсказало историческое событие - знаменитый полет Гагарина, который как раз совпал с датой приобретения нового дома хозяевами. Поэтому гостиная от \"Фазенды\" - это сплошной космос: яркие краски, простые формы из 60-х годов, космические обои и потолок..."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "12:00",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Обнимая небо. 4-я - 6-я серии",
                            "time": "13:00",
                            "category": "Сериалы",
                            "description": "4-я серия. Антонина рассказывает Марине о связи Жени и Вани. Марина приходит в бешенство и устраивает Жене истерику. Алевтина признается Хворостову, что беременна. Тот вынуждает Алю пойти на криминальный аборт..."
                        },
                        {
                            "title": "Кронштадт 1921. 1-я серия",
                            "time": "15:20",
                            "category": "Сериалы",
                            "description": "1921 год. Россия. Позади революция и Гражданская война. Однако пять лет яростной кровавой борьбы не дали народу ни земли, ни заводов, ни гарантий мира и благосостояния. В стране голод и разруха. Единственное место, где жизнь идет более-менее благополучно, - город Кронштадт на острове Котлин в Финском заливе..."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "17:45",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Зубная фея",
                            "time": "20:00",
                            "category": "Фильмы",
                            "description": "Дерек Томпсон - свирепый хоккеист, не любящий играть по правилам и нередко во время матчей лишающий своих соперников зубов, за что получил прозвище \"Зубная Фея\". Он и в личной жизни не отличается тактом, не верит в чудеса и считает, что мечтать глупо."
                        }
                    ]
        },
        {
            "title": "Россия 1",
            "image": "images/russia_1",
            "programms": [
                {
                    "title": "Утро России",
                    "time": "07:55",
                    "category": "Инфо",
                    "description": "Чтобы утром оказаться в курсе самых свежих новостей, достаточно с 5.00 до 9.00 на пульте телевизора нажать вторую кнопку. Мощнейшая информационная база - залог успеха программы. В ее основе - контакт со всеми крупнейшими информационными агентствами и огромная сеть собственных региональных корреспондентов."
                },
                {
                    "title": "Тайны следствия-10. Черная метка",
                    "time": "08:40",
                    "category": "Сериалы",
                    "description": "Тайны следствия-10. Черная метка. Расследуя очередное дело..."
                },
                {
                    "title": "Утренняя почта",
                    "time": "10:00",
                    "category": "Досуг",
                    "description": "Артисты разговорного жанра, известные юмористы братья Пономаренко, со свойственными им позитивной энергетикой и оптимистичным взглядом на жизнь приглашают зрителей посмотреть лучшие концертные номера и послушать любимые песни."
                },
                {
                    "title": "Местное время. Вести-Москва. Неделя в городе",
                    "time": "11:30",
                    "category": "Инфо",
                    "description": "Новости, происшествия, репортажи - все, что произошло в столице за неделю."
                },
                {
                    "title": "Позови, и я приду",
                    "time": "13:10",
                    "category": "Фильмы",
                    "description": "Своенравный характер и подростковая страсть приводят главную героиню к печальным последствиям - она слишком рано становится матерью и вынуждена оставить сына в детском доме. Встав на ноги, девушка не может смириться с принятым ранее решением и всеми силами пытается разыскать своего ребенка."
                },
                {
                    "title": "Вести",
                    "time": "14:00",
                    "category": "Инфо",
                    "description": "13 мая 1991 года первым выпуском информационной программы \"Вести\" началась история телеканала \"Россия\". \"Вести\", которые можно смело назвать главной информационной программой страны, всегда являлись визитной карточкой телеканала."
                },
                {
                    "title": "По горячим следам",
                    "time": "15:00",
                    "category": "Сериалы",
                    "description": "В полицию обращается женщина - пропал ее сын, 18-летний Петя. Пропал из больницы, в которую попал несколько часов назад с черепно-мозговой травмой. Врач сказал матери, что, по словам свидетелей, Петя ехал на футбольный матч в компании фанатов и подрался с фанатами команды-соперника..."
                },
                {
                    "title": "Без следа. 13-я серия",
                    "time": "16:10",
                    "category": "Сериалы",
                    "description": "13-я серия. Молодой талантливый врач Руслан бесследно пропадает в разгар рабочей недели. Следователям становится известно, что в жизни героя была черная полоса – начальство отказало ему в рекомендации на работу его мечты, а любимая девушка отвергла предложение руки и сердца..."
                }
                ,
                {
                    "title": "Без следа. 14-я серия",
                    "time": "17:20",
                    "category": "Сериалы",
                    "description": "14-я серия. Молодой талантливый врач Руслан бесследно пропадает в разгар рабочей недели. Следователям становится известно, что в жизни героя была черная полоса – начальство отказало ему в рекомендации на работу его мечты, а любимая девушка отвергла предложение руки и сердца..."
                }
            ]
        },
        {
            "title": "ТВ Центр",
            "image": "images/tvc",
            "programms": [
                {
                    "time": "08:45",
                    "title": "Советский космос: четыре короля",
                    "category": "Фильмы",
                    "description": "Фильм Леонида Млечина. Есть что-то роковое в том, как совпали судьбы главных создателей советских ракет - Сергея Королёва и Валентина Глушко. Почти ровесники, они одновременно стали заниматься любимым делом."
                },
                {
                    "time": "09:40",
                    "title": "Настроение",
                    "category": "Досуг",
                    "description": "Теперь компанию Роману Демченко и Алене Горенко составят Александр Серебренников и Инна Лунева. Каждой паре предстоит вести эфиры через неделю. Видоизменились и сами рубрики."
                },
                {
                    "time": "10:55",
                    "title": "Сергей Никоненко. О, счастливчик!",
                    "category": "Досуг",
                    "description": "Сергей Никоненко, отметивший 70-летие, в актерской среде считается невероятным везунчиком: все ему удается, все получается, он не знает простоев - даже когда в 1996 году на \"Мосфильме\" снималась всего одна картина, для него в ней нашлась роль."
                },
                {
                    "time": "11:00",
                    "title": "События",
                    "category": "Инфо",
                    "description": "Основная ежедневная информационная программа канала, посвященная важнейшим общественным, политическим, экономическим и культурным событиям дня в России и за рубежом."
                },
                {
                    "time": "11:45",
                    "title": "Петровка, 38",
                    "category": "Инфо",
                    "description": "Ежедневная телепрограмма, подготовленная телестудией ГУВД Москвы. В программе даётся оперативная сводка происшествий по городу."
                },
                {
                    "time": "14:00",
                    "title": "Город новостей",
                    "category": "Инфо",
                    "description": "В программе - информация, касающаяся разных сторон жизни мегаполиса – экономики, городского хозяйства, социальной сферы, спорта, погоды."
                },
                {
                    "time": "14:30",
                    "title": "Право голоса",
                    "category": "Досуг",
                    "description": "Право голоса это место для дискуссий и арена для политических баталий. Самые острые общественно-политические проблемы страны обсуждаются вне правил и регламента."
                },
                {
                    "time": "15:15",
                    "title": "Каменская (Игра на чужом поле)",
                    "category": "Инфо",
                    "description": "Получив отпуск, Настя уезжает в санаторий \"Долина\", где попадает в гущу криминальных событий. В курортном городке работает подпольная киностудия, где снимают странные фильмы с кровавыми сюжетами. А потом начинаются самые что ни на есть реальные убийства."
                }
                ,
                {
                    "time": "18:00",
                    "title": "Запасной инстинкт",
                    "category": "Фильмы",
                    "description": "Встретившись в кафе, подруги Катя, Жанна и Ирина обращают внимание на странную пару за соседним столом: женщина тайно передает мужчине конверт. А несколько минут спустя они видят в туалете на полу того самого мужчину застреленным."
                }
            ]
        },
        {
            "title": "Матч ТВ",
            "image": "images/match_tv",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Ты можешь больше!",
                    "category": "Досуг",
                    "description": "Это не программа про скучный спортзал и строгую диету. Вы научитесь правильно питаться и заниматься зарядкой так, как никто и никогда этого не делал. Образ жизни начинается с мыслей - а они должны быть позитивными! Каждый человек должен начать путь с дивана в активную жизнь. Наши ведущие: Маша Командная, Сергей Кривохарченко, Алексей Михайлов, Ольга Березуцкая, эксперты и гости помогут сделать жизнь лучше, ну или, хотя бы - веселее! Зарядки, вкусные и полезные блюда, правила спорта и мотивирующие истории наших героев - все это - \"Ты можешь больше!\""
                },
                {
                    "time": "10:05",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "10:55",
                    "title": "Футбол. Чемпионат Италии",
                    "category": "Спорт",
                    "description": "Встреча \"Милана\" и \"Ювентуса\" вызывает колоссальный интерес не только в Италии, но и далеко за ее пределами. Миланский клуб пытается вскочить на подножку уходящего поезда и попасть в зону еврокубков. Туринцы же являются лидерами Серии А и стремительными шагами движутся к своему очередному Скудетто. "
                },
                {
                    "time": "12:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                },
                {
                    "time": "14:00",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "14:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                }
                ,
                {
                    "time": "16:50",
                    "title": "Хоккей. Еврочеллендж. Россия - Норвегия",
                    "category": "Спорт",
                    "description": "Европейский хоккейный вызов, также известен как ЕвроЧеллендж — ежегодная серия международных турниров по хоккею с шайбой, проводящаяся с 2001 года. Является своего рода аналогом Еврохоккейтура, в котором принимают участие сборные Первого дивизиона, не входящие в число элитных команд мира, и сборные Второго дивизиона."
                }
            ]
        },
        {
            "title": "Пятница",
            "image": "images/pyatnica",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Вуди Вудпекер",
                    "category": "Детям",
                    "description": "Обновленная версия приключений неутомимого дятла Вуди. Недаром Вуди называют американским дятлом номер один. Песня из мультфильма про этого дятла возглавила хит-парады аж в 48-м году, а его смех до сих пор является фирменной маркой американской мультипликации."
                },
                {
                    "time": "09:05",
                    "title": "Смешарики",
                    "category": "Детям",
                    "description": "На планете Земля существует вымышленная страна, где живут забавные круглые зверушки. Здесь новый день не похож на предыдущий, обитатели чудесного места постоянно придумывают себе захватывающие приключения."
                },
                {
                    "time": "10:55",
                    "title": "Школа доктора Комаровского. Классный журнал",
                    "category": "Досуг",
                    "description": "Он действительно доктор, а не шоумен в белом халате! Он реально рассказывает, как сохранить здоровье наших любимых, а не устраивает клоунаду перед камерой."
                },
                {
                    "time": "12:30",
                    "title": "Блокбастеры!",
                    "category": "Досуг",
                    "description": "Андрей Бедняков и Настя Короткая приглашают вас в невероятное путешествие по местам любимых фильмов. Оказавшись в роли известных киногероев, они повторят их маршруты, узнают секреты съемок и покажут, что изменилось с тех пор, как в этих местах прозвучала команда Стоп, снято!"
                },
                {
                    "time": "14:00",
                    "title": "Орел и решка. Кругосветка",
                    "category": "Досуг",
                    "description": "Регина Тодоренко и Леся Никитюк отправляются в самое захватывающее путешествие - в кругосветку. Две блондинки, девять месяцев непрерывного путешествия и миллион всего, ради чего стоит путешествовать."
                },
                {
                    "time": "15:30",
                    "title": "Поймай меня, если сможешь",
                    "category": "Фильмы",
                    "description": "Фрэнк Эбэгнейл успел поработать врачом, адвокатом и пилотом на пассажирской авиалинии – и все это до достижения полного совершеннолетия в 21 год. Мастер в обмане и жульничестве, он также обладал искусством подделки документов, что в конечном счете принесло ему миллионы долларов, которые он получил по фальшивым чекам."
                }
                ,
                {
                    "time": "17:50",
                    "title": "Аферисты в сетях",
                    "category": "Досуг",
                    "description": "Вероятно, многие из нас становились невольными жертвами изощренных мошенников - аферистов. Вы никогда не определите в том или ином человеке профессионального афериста, ведь мастерски провернутая афера - это своего рода искусство."
                }
            ]
        }
    ];

var wednesdayTVProgramm = new TVProgramm();
wednesdayTVProgramm.channels =
    [
        {
            "title": "Первый",
            "image": "images/1_kanal",
            "programms": [
                        {
                            "title": "Телеканал Доброе утро",
                            "time": "8:00",
                            "category": "Досуг",
                            "description": "Утренний информационно-развлекательный телеканал появился в 1986 году."
                        }, 
                        {
                            "title": "Новости",
                            "time": "9:00",
                            "category": "Инфо",
                            "description": "Новости"
                        }, 
                        {
                            "title": "Контрольная закупка",
                            "time": "9:30",
                            "category": "Досуг",
                            "description": "Программа основана на конкурсе товаров с объявлением победителя.  Новые рубрики: Контрольный рейд - основная задача  - узнать, какие продукты продаются на прилавках рынков и магазинов, с какими проблемами сталкивается рядовой покупатель, и научить продавца соблюдать законы."
                        }, 
                        {
                            "title": "Жить здорово!",
                            "time": "10:20",
                            "category": "Досуг",
                            "description": "Жить здорово!"
                        }, 
                        {
                            "title": "Модный приговор",
                            "time": "11:20",
                            "category": "Досуг",
                            "description": "Модный приговор"
                        }, 
                        {
                            "title": "Новости с субтитрами",
                            "time": "13:00",
                            "category": "Инфо",
                            "description": "Новости с субтитрами"
                        }, 
                        {
                            "title": "Время покажет",
                            "time": "15:25",
                            "category": "Досуг",
                            "description": "Время покажет"
                        }, 
                        {
                            "title": "Новости с субтитрами",
                            "time": "17:00",
                            "category": "Инфо",
                            "description": "Новости с субтитрами"
                        }, 
                        {
                            "title": "Время покажет",
                            "time": "18:00",
                            "category": "Досуг",
                            "description": "Время покажет"
                        }, 
                        {
                            "title": "Мужское / Женское",
                            "time": "19:00",
                            "category": "Досуг",
                            "description": "Проект, который попытается помочь мужчинам и женщинам разобраться в их отношениях."
                        }, 
                        {
                            "title": "Наедине со всеми",
                            "time": "20:10",
                            "category": "Досуг",
                            "description": "Программа-интервью с известными людьми."
                        }
                    ]
        },
        {
            "title": "Россия 1",
            "image": "images/russia_1",
            "programms": [
                {
                    "title": "Комната смеха",
                    "time": "07:00",
                    "category": "Досуг",
                    "description": "Лучшие монологи, миниатюры и клоунские номера отечественной сатиры. Классика жанра в исполнении Аркадия Райкина, Жванецкого, Семена Альтова и других патриархов. Шедевры из программы \"Вокруг смеха\" и новая волна сатириков."
                },
                {
                    "time": "08:00",
                    "title": "События",
                    "category": "Инфо",
                    "description": "Основная ежедневная информационная программа канала, посвященная важнейшим общественным, политическим, экономическим и культурным событиям дня в России и за рубежом."
                },
                {
                    "time": "10:00",
                    "title": "Смех с доставкой на дом",
                    "category": "Досуг",
                    "description": "Смех с доставкой на дом."
                },
                {
                    "title": "Местное время. Вести-Москва. Неделя в городе",
                    "time": "10:20",
                    "category": "Инфо",
                    "description": "Новости, происшествия, репортажи - все, что произошло в столице за неделю."
                },
                {
                    "title": "Позови, и я приду",
                    "time": "13:10",
                    "category": "Фильмы",
                    "description": "Своенравный характер и подростковая страсть приводят главную героиню к печальным последствиям - она слишком рано становится матерью и вынуждена оставить сына в детском доме. Встав на ноги, девушка не может смириться с принятым ранее решением и всеми силами пытается разыскать своего ребенка."
                },
                {
                    "title": "Вести",
                    "time": "14:00",
                    "category": "Инфо",
                    "description": "13 мая 1991 года первым выпуском информационной программы \"Вести\" началась история телеканала \"Россия\". \"Вести\", которые можно смело назвать главной информационной программой страны, всегда являлись визитной карточкой телеканала."
                },
                {
                    "title": "По горячим следам",
                    "time": "15:00",
                    "category": "Сериалы",
                    "description": "В полицию обращается женщина - пропал ее сын, 18-летний Петя. Пропал из больницы, в которую попал несколько часов назад с черепно-мозговой травмой. Врач сказал матери, что, по словам свидетелей, Петя ехал на футбольный матч в компании фанатов и подрался с фанатами команды-соперника..."
                },
                {
                    "title": "Без следа. 15-я серия",
                    "time": "16:10",
                    "category": "Сериалы",
                    "description": "15-я серия. Молодой талантливый врач Руслан бесследно пропадает в разгар рабочей недели. Следователям становится известно, что в жизни героя была черная полоса – начальство отказало ему в рекомендации на работу его мечты, а любимая девушка отвергла предложение руки и сердца..."
                }
                ,
                {
                    "title": "Без следа. 16-я серия",
                    "time": "17:20",
                    "category": "Сериалы",
                    "description": "16-я серия. Молодой талантливый врач Руслан бесследно пропадает в разгар рабочей недели. Следователям становится известно, что в жизни героя была черная полоса – начальство отказало ему в рекомендации на работу его мечты, а любимая девушка отвергла предложение руки и сердца..."
                }
            ]
        },
        {
            "title": "ТВ Центр",
            "image": "images/tvc",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Разрешите тебя поцеловать... На свадьбе",
                    "category": "Фильмы",
                    "description": "Разрешите тебя поцеловать... На свадьбе"
                },
                {
                    "time": "08:45",
                    "title": "Советский космос: четыре короля",
                    "category": "Фильмы",
                    "description": "Фильм Леонида Млечина. Есть что-то роковое в том, как совпали судьбы главных создателей советских ракет - Сергея Королёва и Валентина Глушко. Почти ровесники, они одновременно стали заниматься любимым делом."
                },
                {
                    "time": "09:40",
                    "title": "Настроение",
                    "category": "Досуг",
                    "description": "Теперь компанию Роману Демченко и Алене Горенко составят Александр Серебренников и Инна Лунева. Каждой паре предстоит вести эфиры через неделю. Видоизменились и сами рубрики."
                },
                {
                    "time": "10:55",
                    "title": "Сергей Никоненко. О, счастливчик!",
                    "category": "Досуг",
                    "description": "Сергей Никоненко, отметивший 70-летие, в актерской среде считается невероятным везунчиком: все ему удается, все получается, он не знает простоев - даже когда в 1996 году на \"Мосфильме\" снималась всего одна картина, для него в ней нашлась роль."
                },
                {
                    "time": "11:45",
                    "title": "Петровка, 38",
                    "category": "Инфо",
                    "description": "Ежедневная телепрограмма, подготовленная телестудией ГУВД Москвы. В программе даётся оперативная сводка происшествий по городу."
                },
                {
                    "time": "13:55",
                    "title": "Смех с доставкой на дом",
                    "category": "Досуг",
                    "description": "Смех с доставкой на дом."
                },
                {
                    "time": "16:30",
                    "title": "Московская неделя",
                    "category": "Сериалы",
                    "description": "Тележурнал о нашем городе, о людях, которые в нем живут, и о наиболее заметных событиях прошедших семи дней. Все грани столичной жизни: от экономики и градостроительства - до истории, культуры и даже московских тайн."
                }
            ]
        },
        {
            "title": "Матч ТВ",
            "image": "images/match_tv",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Несерьезно о футболе",
                    "category": "Досуг",
                    "description": "Несерьезно о футболе"
                },
                {
                    "time": "10:05",
                    "title": "Олимпийский спорт",
                    "category": "Инфо",
                    "description": "О спорте."
                },
                {
                    "time": "10:55",
                    "title": "Футбол. Чемпионат Италии",
                    "category": "Спорт",
                    "description": "Встреча \"Милана\" и \"Ювентуса\" вызывает колоссальный интерес не только в Италии, но и далеко за ее пределами. Миланский клуб пытается вскочить на подножку уходящего поезда и попасть в зону еврокубков. Туринцы же являются лидерами Серии А и стремительными шагами движутся к своему очередному Скудетто. "
                },
                {
                    "time": "12:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                },
                {
                    "time": "14:00",
                    "title": "Где рождаются чемпионы?",
                    "category": "Спорт",
                    "description": "Где рождаются чемпионы?"
                },
                {
                    "time": "14:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                }
                ,
                {
                    "time": "16:50",
                    "title": "Хоккей. Еврочеллендж. Россия - Норвегия",
                    "category": "Спорт",
                    "description": "Европейский хоккейный вызов, также известен как ЕвроЧеллендж — ежегодная серия международных турниров по хоккею с шайбой, проводящаяся с 2001 года. Является своего рода аналогом Еврохоккейтура, в котором принимают участие сборные Первого дивизиона, не входящие в число элитных команд мира, и сборные Второго дивизиона."
                }
            ]
        },
        {
            "title": "Пятница",
            "image": "images/pyatnica",
            "programms": [
                {
                    "time": "08:55",
                    "title": "Пятница News",
                    "category": "Досуг",
                    "description": "Никакой политики и экономики, только позитивные самые свежие новости из мира российского и зарубежного шоу-бизнеса. Скандалы, редчайшие съемки и абсолютные эксклюзивы."
                },
                {
                    "time": "10:00",
                    "title": "Орел и решка",
                    "category": "Досуг",
                    "description": "Орел и решка"
                },
                {
                    "time": "10:55",
                    "title": "Классный журнал",
                    "category": "Досуг",
                    "description": "Он действительно доктор, а не шоумен в белом халате! Он реально рассказывает, как сохранить здоровье наших любимых, а не устраивает клоунаду перед камерой."
                },
                {
                    "time": "12:30",
                    "title": "Блокбастеры!",
                    "category": "Досуг",
                    "description": "Андрей Бедняков и Настя Короткая приглашают вас в невероятное путешествие по местам любимых фильмов. Оказавшись в роли известных киногероев, они повторят их маршруты, узнают секреты съемок и покажут, что изменилось с тех пор, как в этих местах прозвучала команда Стоп, снято!"
                },
                {
                    "time": "14:00",
                    "title": "Орел и решка. Кругосветка",
                    "category": "Досуг",
                    "description": "Регина Тодоренко и Леся Никитюк отправляются в самое захватывающее путешествие - в кругосветку. Две блондинки, девять месяцев непрерывного путешествия и миллион всего, ради чего стоит путешествовать."
                },
                {
                    "time": "15:30",
                    "title": "Рухнувшие небеса",
                    "category": "Фильмы",
                    "description": "Люди, оставшиеся в живых после нападения инопланетян на Землю, собираются вместе, чтобы сразиться с захватчиками и спасти жизнь на Земле."
                },
                {
                    "time": "12:30",
                    "title": "Блокбастеры!",
                    "category": "Досуг",
                    "description": "Андрей Бедняков и Настя Короткая приглашают вас в невероятное путешествие по местам любимых фильмов. Оказавшись в роли известных киногероев, они повторят их маршруты, узнают секреты съемок и покажут, что изменилось с тех пор, как в этих местах прозвучала команда Стоп, снято!"
                }
            ]
        }
        
        
    ];

var thursdayTVProgramm = new TVProgramm();
thursdayTVProgramm.channels = 
    [
        {
            "title": "Первый",
            "image": "images/1_kanal",
            "programms": [
                        {
                            "title": "Армейский магазин",
                            "time": "08:00",
                            "category": "Досуг",
                            "description": "\"Армейский магазин\" - одна из самых популярных информационно-развлекательных программ на отечественном телевидении вот уже 12 лет. Такая популярность объясняется, прежде всего тем, что программа рассчитана на широкую зрительскую аудиторию – от семей военнослужащих, до действительных и потенциальных призывников и их родных и близких."
                        },
                        {
                            "title": "Смешарики. Пин-код",
                            "time": "09:20",
                            "category": "Детям",
                            "description": "Веселые уроки по выходным. Непобедимая команда снова с нами. Легко и просто о самых сложных вещах."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "10:00",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Фазенда. Космос в гостиной",
                            "time": "10:50",
                            "category": "Досуг",
                            "description": "Идею проекта подсказало историческое событие - знаменитый полет Гагарина, который как раз совпал с датой приобретения нового дома хозяевами. Поэтому гостиная от \"Фазенды\" - это сплошной космос: яркие краски, простые формы из 60-х годов, космические обои и потолок..."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "12:00",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Обнимая небо. 4-я - 6-я серии",
                            "time": "12:30",
                            "category": "Сериалы",
                            "description": "4-я серия. Антонина рассказывает Марине о связи Жени и Вани. Марина приходит в бешенство и устраивает Жене истерику. Алевтина признается Хворостову, что беременна. Тот вынуждает Алю пойти на криминальный аборт..."
                        },
                        {
                            "title": "Кронштадт 1921. 1-я серия",
                            "time": "15:30",
                            "category": "Сериалы",
                            "description": "1921 год. Россия. Позади революция и Гражданская война. Однако пять лет яростной кровавой борьбы не дали народу ни земли, ни заводов, ни гарантий мира и благосостояния. В стране голод и разруха. Единственное место, где жизнь идет более-менее благополучно, - город Кронштадт на острове Котлин в Финском заливе..."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "18:00",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Зубная фея",
                            "time": "18:45",
                            "category": "Фильмы",
                            "description": "Дерек Томпсон - свирепый хоккеист, не любящий играть по правилам и нередко во время матчей лишающий своих соперников зубов, за что получил прозвище \"Зубная Фея\". Он и в личной жизни не отличается тактом, не верит в чудеса и считает, что мечтать глупо."
                        }
                    ]
        },
        {
            "title": "Россия 1",
            "image": "images/russia_1",
            "programms": [
                {
                    "title": "Комната смеха",
                    "time": "07:00",
                    "category": "Досуг",
                    "description": "Лучшие монологи, миниатюры и клоунские номера отечественной сатиры. Классика жанра в исполнении Аркадия Райкина, Жванецкого, Семена Альтова и других патриархов. Шедевры из программы \"Вокруг смеха\" и новая волна сатириков."
                },
                {
                    "time": "08:00",
                    "title": "Футбол. Чемпионат",
                    "category": "Спорт",
                    "description": "Футбол. Чемпионат"
                },
                {
                    "title": "Утренняя почта",
                    "time": "08:50",
                    "category": "Досуг",
                    "description": "Артисты разговорного жанра, известные юмористы братья Пономаренко, со свойственными им позитивной энергетикой и оптимистичным взглядом на жизнь приглашают зрителей посмотреть лучшие концертные номера и послушать любимые песни."
                },
                {
                    "title": "Местное время. Вести-Москва. Неделя в городе",
                    "time": "10:20",
                    "category": "Инфо",
                    "description": "Новости, происшествия, репортажи - все, что произошло в столице за неделю."
                },
                {
                    "title": "Прямой эфир",
                    "time": "13:10",
                    "category": "Досуг",
                    "description": "Полемическое ток-шоу с Борисом Корчевниковым. Об этих проблемах не пишут в СМИ. Но они существуют! Это реальные проблемы обычных людей, оказавшихся в сложных жизненных ситуациях."
                },
                {
                    "title": "Вести",
                    "time": "14:00",
                    "category": "Инфо",
                    "description": "13 мая 1991 года первым выпуском информационной программы \"Вести\" началась история телеканала \"Россия\". \"Вести\", которые можно смело назвать главной информационной программой страны, всегда являлись визитной карточкой телеканала."
                },
                {
                    "title": "Специальный корреспондент",
                    "time": "15:45",
                    "category": "Инфо",
                    "description": "Популярная публицистическая программа, которая выходит с сентября 2002 года. Каждую неделю один из ведущих рассказывает в своем фильме-репортаже о какой-либо актуальной проблеме, существующей в современном обществе, посвящает зрительскую аудиторию в подробности наиболее значимых для страны и мира событий."
                },
                {
                    "title": "Личный интерес",
                    "time": "16:10",
                    "category": "Сериалы",
                    "description": "Татьяна убегает из зоны, она приезжает в глухое село Павловка - в дом своей покойной бабушки. Там она встречает Максима, который приехал в деревню, чтобы отдохнуть от городской суеты. Между ними возникает взаимное чувство."
                }
                ,
                {
                    "title": "Один в один. Битва сезонов",
                    "time": "18:40",
                    "category": "Досуг",
                    "description": "В новом сезоне шоу встречаются победители и финалисты всех предыдущих сезонов! Каждую неделю десять знаменитостей примеряют на себя образ легендарных музыкантов прошлого и настоящего, полностью копируя оригинальный стиль артиста: от манеры двигаться до тембра голоса."
                }
            ]
        },
        {
            "title": "ТВ Центр",
            "image": "images/tvc",
            "programms": [
                {
                    "time": "08:55",
                    "title": "Барышня и кулинар",
                    "category": "Досуг",
                    "description": "Кулинарная программа с участием двух постоянных ведущих. Опытный кулинар Михаил Плотников еженедельно дает уроки приготовления вкусной и здоровой пищи своей ученице - Анне Семенович."
                },
                {
                    "time": "10:30",
                    "title": "События",
                    "category": "Инфо",
                    "description": "Основная ежедневная информационная программа канала, посвященная важнейшим общественным, политическим, экономическим и культурным событиям дня в России и за рубежом."
                },
                {
                    "time": "11:45",
                    "title": "Петровка, 38",
                    "category": "Инфо",
                    "description": "Ежедневная телепрограмма, подготовленная телестудией ГУВД Москвы. В программе даётся оперативная сводка происшествий по городу."
                },
                {
                    "time": "13:00",
                    "title": "Смех с доставкой на дом",
                    "category": "Досуг",
                    "description": "Смех с доставкой на дом."
                },
                {
                    "time": "13:45",
                    "title": "Советский космос: четыре короля",
                    "category": "Фильмы",
                    "description": "Фильм Леонида Млечина. Есть что-то роковое в том, как совпали судьбы главных создателей советских ракет - Сергея Королёва и Валентина Глушко. Почти ровесники, они одновременно стали заниматься любимым делом."
                },
                {
                    "time": "15:40",
                    "title": "Настроение",
                    "category": "Досуг",
                    "description": "Теперь компанию Роману Демченко и Алене Горенко составят Александр Серебренников и Инна Лунева. Каждой паре предстоит вести эфиры через неделю. Видоизменились и сами рубрики."
                },
                {
                    "time": "16:55",
                    "title": "Сергей Никоненко. О, счастливчик!",
                    "category": "Досуг",
                    "description": "Сергей Никоненко, отметивший 70-летие, в актерской среде считается невероятным везунчиком: все ему удается, все получается, он не знает простоев - даже когда в 1996 году на \"Мосфильме\" снималась всего одна картина, для него в ней нашлась роль."
                }
            ]
        },
        {
            "title": "Матч ТВ",
            "image": "images/match_tv",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Ты можешь больше!",
                    "category": "Досуг",
                    "description": "Это не программа про скучный спортзал и строгую диету. Вы научитесь правильно питаться и заниматься зарядкой так, как никто и никогда этого не делал. Образ жизни начинается с мыслей - а они должны быть позитивными! Каждый человек должен начать путь с дивана в активную жизнь. Наши ведущие: Маша Командная, Сергей Кривохарченко, Алексей Михайлов, Ольга Березуцкая, эксперты и гости помогут сделать жизнь лучше, ну или, хотя бы - веселее! Зарядки, вкусные и полезные блюда, правила спорта и мотивирующие истории наших героев - все это - \"Ты можешь больше!\""
                },
                {
                    "time": "10:05",
                    "title": "Олимпийский спорт",
                    "category": "Инфо",
                    "description": "О спорте."
                },
                {
                    "time": "12:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                },
                {
                    "time": "14:00",
                    "title": "Где рождаются чемпионы?",
                    "category": "Спорт",
                    "description": "Где рождаются чемпионы?"
                },
                {
                    "time": "10:55",
                    "title": "Футбол. Чемпионат Италии",
                    "category": "Спорт",
                    "description": "Встреча \"Милана\" и \"Ювентуса\" вызывает колоссальный интерес не только в Италии, но и далеко за ее пределами. Миланский клуб пытается вскочить на подножку уходящего поезда и попасть в зону еврокубков. Туринцы же являются лидерами Серии А и стремительными шагами движутся к своему очередному Скудетто. "
                },
                {
                    "time": "12:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                },
                {
                    "time": "14:00",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "14:30",
                    "title": "Смешанные единоборства. UFC",
                    "category": "Спорт",
                    "description": "Смешанные единоборства. UFC"
                }
                ,
                {
                    "time": "17:50",
                    "title": "Континентальный вечер",
                    "category": "Спорт",
                    "description": "Континентальный вечер"
                }
            ]
        },
        {
            "title": "Пятница",
            "image": "images/pyatnica",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Барышня-крестьянка",
                    "category": "Досуг",
                    "description": "Богатая и бедная девушки на три дня поменяются всем - домами, одеждой, друзьями и даже привычками. Что ждет их: приятный шок или разочарование?"
                },
                {
                    "time": "09:05",
                    "title": "Смешарики",
                    "category": "Детям",
                    "description": "На планете Земля существует вымышленная страна, где живут забавные круглые зверушки. Здесь новый день не похож на предыдущий, обитатели чудесного места постоянно придумывают себе захватывающие приключения."
                },
                {
                    "time": "10:55",
                    "title": "Пятница News",
                    "category": "Досуг",
                    "description": "Никакой политики и экономики, только позитивные самые свежие новости из мира российского и зарубежного шоу-бизнеса. Скандалы, редчайшие съемки и абсолютные эксклюзивы."
                },
                {
                    "time": "11:00",
                    "title": "Орел и решка",
                    "category": "Досуг",
                    "description": "Орел и решка"
                },
                {
                    "time": "12:30",
                    "title": "Блокбастеры!",
                    "category": "Досуг",
                    "description": "Андрей Бедняков и Настя Короткая приглашают вас в невероятное путешествие по местам любимых фильмов. Оказавшись в роли известных киногероев, они повторят их маршруты, узнают секреты съемок и покажут, что изменилось с тех пор, как в этих местах прозвучала команда Стоп, снято!"
                },
                {
                    "time": "14:00",
                    "title": "Орел и решка. Кругосветка",
                    "category": "Досуг",
                    "description": "Регина Тодоренко и Леся Никитюк отправляются в самое захватывающее путешествие - в кругосветку. Две блондинки, девять месяцев непрерывного путешествия и миллион всего, ради чего стоит путешествовать."
                },
                {
                    "time": "15:00",
                    "title": "Орел и решка",
                    "category": "Досуг",
                    "description": "Орел и решка"
                },
                {
                    "time": "17:50",
                    "title": "Аферисты в сетях",
                    "category": "Досуг",
                    "description": "Вероятно, многие из нас становились невольными жертвами изощренных мошенников - аферистов. Вы никогда не определите в том или ином человеке профессионального афериста, ведь мастерски провернутая афера - это своего рода искусство."
                }
            ]
        }
        
        
    ];

var fridayTVProgramm = new TVProgramm();
fridayTVProgramm.channels = 
    [
        {
            "title": "Первый",
            "image": "images/1_kanal",
            "programms": [
                        {
                            "title": "Телеканал Доброе утро",
                            "time": "8:00",
                            "category": "Досуг",
                            "description": "Утренний информационно-развлекательный телеканал появился в 1986 году."
                        }, 
                        {
                            "title": "Жить здорово!",
                            "time": "10:20",
                            "category": "Досуг",
                            "description": "Жить здорово!"
                        }, 
                        {
                            "title": "Модный приговор",
                            "time": "11:20",
                            "category": "Досуг",
                            "description": "Модный приговор"
                        }, 
                        {
                            "title": "Новости с субтитрами",
                            "time": "13:00",
                            "category": "Инфо",
                            "description": "Новости с субтитрами"
                        }, 
                        {
                            "title": "Пусть говорят",
                            "time": "13:40",
                            "category": "Досуг",
                            "description": "Пусть говорят"
                        }, 
                        {
                            "title": "Таблетка",
                            "time": "14:40",
                            "category": "Досуг",
                            "description": "Таблетка"
                        }, 
                        {
                            "title": "Время покажет",
                            "time": "15:25",
                            "category": "Досуг",
                            "description": "Время покажет"
                        }, 
                        {
                            "title": "Новости с субтитрами",
                            "time": "17:00",
                            "category": "Инфо",
                            "description": "Новости с субтитрами"
                        }, 
                        {
                            "title": "Время покажет",
                            "time": "18:00",
                            "category": "Досуг",
                            "description": "Время покажет"
                        }, 
                        {
                            "title": "Мужское / Женское",
                            "time": "19:00",
                            "category": "Досуг",
                            "description": "Проект, который попытается помочь мужчинам и женщинам разобраться в их отношениях."
                        }, 
                        {
                            "title": "Наедине со всеми",
                            "time": "20:10",
                            "category": "Досуг",
                            "description": "Программа-интервью с известными людьми."
                        }, 
                        {
                            "title": "Вечерние новости с субтитрами",
                            "time": "21:00",
                            "category": "Инфо",
                            "description": "Вечерние новости с субтитрами"
                        }, {
                            "title": "Давай поженимся!",
                            "time": "21:45",
                            "category": "Досуг",
                            "description": "В новом телевизионном сезоне авторы планируют регулярно знакомить зрителей с парами, которые сложились на их программе. Кто-то из участников пока еще переживает счастливый конфетно-букетный период и бегает на свидания, а кто-то, следуя названию программы, уже побывал в ЗАГСе."
                        }
                    ]
        },
        {
            "title": "Россия 1",
            "image": "images/russia_1",
            "programms": [
                {
                    "title": "Комната смеха",
                    "time": "07:00",
                    "category": "Досуг",
                    "description": "Лучшие монологи, миниатюры и клоунские номера отечественной сатиры. Классика жанра в исполнении Аркадия Райкина, Жванецкого, Семена Альтова и других патриархов. Шедевры из программы \"Вокруг смеха\" и новая волна сатириков."
                },
                {
                    "title": "Следствие ведут знатоки. Дело №21 - \"Без ножа и кастета\", 2-я серия",
                    "time": "08:20",
                    "category": "Сериалы",
                    "description": "Расследуя очередное дело, ЗнаТоКи неожиданно выходят на крупные хищения в обычном ДЭЗе."
                },
                {
                    "title": "Утренняя почта",
                    "time": "08:50",
                    "category": "Досуг",
                    "description": "Артисты разговорного жанра, известные юмористы братья Пономаренко, со свойственными им позитивной энергетикой и оптимистичным взглядом на жизнь приглашают зрителей посмотреть лучшие концертные номера и послушать любимые песни."
                },
                {
                    "title": "Местное время. Вести-Москва. Неделя в городе",
                    "time": "10:20",
                    "category": "Инфо",
                    "description": "Новости, происшествия, репортажи - все, что произошло в столице за неделю."
                },
                {
                    "title": "Позови, и я приду",
                    "time": "13:10",
                    "category": "Фильмы",
                    "description": "Своенравный характер и подростковая страсть приводят главную героиню к печальным последствиям - она слишком рано становится матерью и вынуждена оставить сына в детском доме. Встав на ноги, девушка не может смириться с принятым ранее решением и всеми силами пытается разыскать своего ребенка."
                },
                {
                    "title": "Вести",
                    "time": "14:00",
                    "category": "Инфо",
                    "description": "13 мая 1991 года первым выпуском информационной программы \"Вести\" началась история телеканала \"Россия\". \"Вести\", которые можно смело назвать главной информационной программой страны, всегда являлись визитной карточкой телеканала."
                },
                {
                    "title": "По горячим следам",
                    "time": "15:00",
                    "category": "Сериалы",
                    "description": "В полицию обращается женщина - пропал ее сын, 18-летний Петя. Пропал из больницы, в которую попал несколько часов назад с черепно-мозговой травмой. Врач сказал матери, что, по словам свидетелей, Петя ехал на футбольный матч в компании фанатов и подрался с фанатами команды-соперника..."
                },
                {
                    "title": "Личный интерес",
                    "time": "16:10",
                    "category": "Сериалы",
                    "description": "Татьяна убегает из зоны, она приезжает в глухое село Павловка - в дом своей покойной бабушки. Там она встречает Максима, который приехал в деревню, чтобы отдохнуть от городской суеты. Между ними возникает взаимное чувство."
                }
                ,
                {
                    "title": "Один в один. Битва сезонов",
                    "time": "17:20",
                    "category": "Досуг",
                    "description": "В новом сезоне шоу встречаются победители и финалисты всех предыдущих сезонов! Каждую неделю десять знаменитостей примеряют на себя образ легендарных музыкантов прошлого и настоящего, полностью копируя оригинальный стиль артиста: от манеры двигаться до тембра голоса."
                }
            ]
        },
        {
            "title": "ТВ Центр",
            "image": "images/tvc",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Доктор И...",
                    "category": "Досуг",
                    "description": "Вести здоровый образ жизни - это не только правильно, но и модно. Прекрасно выглядеть научит новое ток-шоу"
                },
                {
                    "time": "10:55",
                    "title": "Отец Браун. Сезон 2. 1-я серия",
                    "category": "Сериалы",
                    "description": "Отец Браун приглашен к Шарлотте МакКенли. Она уверена, что ее посещает привидение сестры Элспид, пропавшей девять лет назад. Но, неожиданно, исчезает сама Шарлотта, мирно читавшая книгу в своей комнате."
                },
                {
                    "time": "11:55",
                    "title": "Отец Браун. Сезон 2. 2-я серия",
                    "category": "Сериалы",
                    "description": "Отец Браун приглашен к Шарлотте МакКенли. Она уверена, что ее посещает привидение сестры Элспид, пропавшей девять лет назад. Но, неожиданно, исчезает сама Шарлотта, мирно читавшая книгу в своей комнате."
                },
                {
                    "time": "11:30",
                    "title": "События",
                    "category": "Инфо",
                    "description": "Основная ежедневная информационная программа канала, посвященная важнейшим общественным, политическим, экономическим и культурным событиям дня в России и за рубежом."
                },
                {
                    "time": "12:45",
                    "title": "Петровка, 38",
                    "category": "Инфо",
                    "description": "Ежедневная телепрограмма, подготовленная телестудией ГУВД Москвы. В программе даётся оперативная сводка происшествий по городу."
                },
                {
                    "time": "13:00",
                    "title": "Смех с доставкой на дом",
                    "category": "Досуг",
                    "description": "Смех с доставкой на дом."
                },
                {
                    "time": "14:30",
                    "title": "Московская неделя",
                    "category": "Сериалы",
                    "description": "Ттележурнал о нашем городе, о людях, которые в нем живут, и о наиболее заметных событиях прошедших семи дней. Все грани столичной жизни: от экономики и градостроительства - до истории, культуры и даже московских тайн."
                },
                {
                    "time": "15:00",
                    "title": "Ход конем",
                    "category": "Фильмы",
                    "description": "Пятнадцатилетнего Лешку Левшина, мечтающего стать таким же классным трактористом, как передовик Шугай, из-за возраста не подпускают к машине. Но у него есть взрослый друг - прицепщик Колька Лопатин, который давно мечтает о беззаботной городской жизни."
                }
                ,
                {
                    "time": "17:30",
                    "title": "Хроники московского быта. Женщины первых миллионеров",
                    "category": "Досуг",
                    "description": "Как сложилась жизнь женщин первых российских миллионеров? Недавно в Луганске умерла спившаяся Наталья Лагода, певица, которая стала известна всей стране после того, как выбросилась из окна из-за того, что ее бросил бизнесмен Александр Карманов..."
                }
            ]
        },
        {
            "title": "Матч ТВ",
            "image": "images/match_tv",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Ты можешь больше!",
                    "category": "Досуг",
                    "description": "Это не программа про скучный спортзал и строгую диету. Вы научитесь правильно питаться и заниматься зарядкой так, как никто и никогда этого не делал. Образ жизни начинается с мыслей - а они должны быть позитивными! Каждый человек должен начать путь с дивана в активную жизнь. Наши ведущие: Маша Командная, Сергей Кривохарченко, Алексей Михайлов, Ольга Березуцкая, эксперты и гости помогут сделать жизнь лучше, ну или, хотя бы - веселее! Зарядки, вкусные и полезные блюда, правила спорта и мотивирующие истории наших героев - все это - \"Ты можешь больше!\""
                },
                {
                    "time": "10:05",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "10:55",
                    "title": "Футбол. Чемпионат Италии",
                    "category": "Спорт",
                    "description": "Встреча \"Милана\" и \"Ювентуса\" вызывает колоссальный интерес не только в Италии, но и далеко за ее пределами. Миланский клуб пытается вскочить на подножку уходящего поезда и попасть в зону еврокубков. Туринцы же являются лидерами Серии А и стремительными шагами движутся к своему очередному Скудетто. "
                },
                {
                    "time": "12:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                },
                {
                    "time": "14:00",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "14:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                }
                ,
                {
                    "time": "16:50",
                    "title": "Хоккей. Еврочеллендж. Россия - Норвегия",
                    "category": "Спорт",
                    "description": "Европейский хоккейный вызов, также известен как ЕвроЧеллендж — ежегодная серия международных турниров по хоккею с шайбой, проводящаяся с 2001 года. Является своего рода аналогом Еврохоккейтура, в котором принимают участие сборные Первого дивизиона, не входящие в число элитных команд мира, и сборные Второго дивизиона."
                }
            ]
        },
        {
            "title": "Пятница",
            "image": "images/pyatnica",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Вуди Вудпекер",
                    "category": "Детям",
                    "description": "Обновленная версия приключений неутомимого дятла Вуди. Недаром Вуди называют американским дятлом номер один. Песня из мультфильма про этого дятла возглавила хит-парады аж в 48-м году, а его смех до сих пор является фирменной маркой американской мультипликации."
                },
                {
                    "time": "09:05",
                    "title": "Смешарики",
                    "category": "Детям",
                    "description": "На планете Земля существует вымышленная страна, где живут забавные круглые зверушки. Здесь новый день не похож на предыдущий, обитатели чудесного места постоянно придумывают себе захватывающие приключения."
                },
                {
                    "time": "10:55",
                    "title": "Школа доктора Комаровского. Классный журнал",
                    "category": "Досуг",
                    "description": "Он действительно доктор, а не шоумен в белом халате! Он реально рассказывает, как сохранить здоровье наших любимых, а не устраивает клоунаду перед камерой."
                },
                {
                    "time": "12:30",
                    "title": "Блокбастеры!",
                    "category": "Досуг",
                    "description": "Андрей Бедняков и Настя Короткая приглашают вас в невероятное путешествие по местам любимых фильмов. Оказавшись в роли известных киногероев, они повторят их маршруты, узнают секреты съемок и покажут, что изменилось с тех пор, как в этих местах прозвучала команда Стоп, снято!"
                },
                {
                    "time": "14:00",
                    "title": "Орел и решка. Кругосветка",
                    "category": "Досуг",
                    "description": "Регина Тодоренко и Леся Никитюк отправляются в самое захватывающее путешествие - в кругосветку. Две блондинки, девять месяцев непрерывного путешествия и миллион всего, ради чего стоит путешествовать."
                },
                {
                    "time": "15:30",
                    "title": "Поймай меня, если сможешь",
                    "category": "Фильмы",
                    "description": "Фрэнк Эбэгнейл успел поработать врачом, адвокатом и пилотом на пассажирской авиалинии – и все это до достижения полного совершеннолетия в 21 год. Мастер в обмане и жульничестве, он также обладал искусством подделки документов, что в конечном счете принесло ему миллионы долларов, которые он получил по фальшивым чекам."
                }
                ,
                {
                    "time": "17:50",
                    "title": "Аферисты в сетях",
                    "category": "Досуг",
                    "description": "Вероятно, многие из нас становились невольными жертвами изощренных мошенников - аферистов. Вы никогда не определите в том или ином человеке профессионального афериста, ведь мастерски провернутая афера - это своего рода искусство."
                }
            ]
        }
        
        
    ];

var saturdayTVProgramm = new TVProgramm();
saturdayTVProgramm.channels = 
    [
        {
            "title": "Первый",
            "image": "images/1_kanal",
            "programms": [
                        {
                            "title": "Армейский магазин",
                            "time": "08:00",
                            "category": "Досуг",
                            "description": "\"Армейский магазин\" - одна из самых популярных информационно-развлекательных программ на отечественном телевидении вот уже 12 лет. Такая популярность объясняется, прежде всего тем, что программа рассчитана на широкую зрительскую аудиторию – от семей военнослужащих, до действительных и потенциальных призывников и их родных и близких."
                        },
                        {
                            "title": "Смешарики. Пин-код",
                            "time": "09:20",
                            "category": "Детям",
                            "description": "Веселые уроки по выходным. Непобедимая команда снова с нами. Легко и просто о самых сложных вещах."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "10:00",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Фазенда. Космос в гостиной",
                            "time": "10:50",
                            "category": "Досуг",
                            "description": "Идею проекта подсказало историческое событие - знаменитый полет Гагарина, который как раз совпал с датой приобретения нового дома хозяевами. Поэтому гостиная от \"Фазенды\" - это сплошной космос: яркие краски, простые формы из 60-х годов, космические обои и потолок..."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "12:00",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Обнимая небо. 4-я - 6-я серии",
                            "time": "12:30",
                            "category": "Сериалы",
                            "description": "4-я серия. Антонина рассказывает Марине о связи Жени и Вани. Марина приходит в бешенство и устраивает Жене истерику. Алевтина признается Хворостову, что беременна. Тот вынуждает Алю пойти на криминальный аборт..."
                        },
                        {
                            "title": "Кронштадт 1921. 1-я серия",
                            "time": "15:30",
                            "category": "Сериалы",
                            "description": "1921 год. Россия. Позади революция и Гражданская война. Однако пять лет яростной кровавой борьбы не дали народу ни земли, ни заводов, ни гарантий мира и благосостояния. В стране голод и разруха. Единственное место, где жизнь идет более-менее благополучно, - город Кронштадт на острове Котлин в Финском заливе..."
                        },
                        {
                            "title": "Новости с субтитрами",
                            "time": "18:00",
                            "category": "Инфо",
                            "description": "Ежедневная информационная программа, сообщающая о наиболее важных событиях в стране и в мире. Оперативно и достоверно мы рассказываем зрителям Первого канала о том, что произошло в области политики, экономики, общественной жизни, культуры, спорта."
                        },
                        {
                            "title": "Зубная фея",
                            "time": "18:45",
                            "category": "Фильмы",
                            "description": "Дерек Томпсон - свирепый хоккеист, не любящий играть по правилам и нередко во время матчей лишающий своих соперников зубов, за что получил прозвище \"Зубная Фея\". Он и в личной жизни не отличается тактом, не верит в чудеса и считает, что мечтать глупо."
                        }
                    ]
        },
        {
            "title": "Россия 1",
            "image": "images/russia_1",
            "programms": [
                {
                    "title": "Комната смеха",
                    "time": "07:00",
                    "category": "Досуг",
                    "description": "Лучшие монологи, миниатюры и клоунские номера отечественной сатиры. Классика жанра в исполнении Аркадия Райкина, Жванецкого, Семена Альтова и других патриархов. Шедевры из программы \"Вокруг смеха\" и новая волна сатириков."
                },
                {
                    "title": "Специальный корреспондент",
                    "time": "07:45",
                    "category": "Инфо",
                    "description": "Популярная публицистическая программа, которая выходит с сентября 2002 года. Каждую неделю один из ведущих рассказывает в своем фильме-репортаже о какой-либо актуальной проблеме, существующей в современном обществе, посвящает зрительскую аудиторию в подробности наиболее значимых для страны и мира событий."
                },
                {
                    "title": "Утренняя почта",
                    "time": "08:20",
                    "category": "Досуг",
                    "description": "Артисты разговорного жанра, известные юмористы братья Пономаренко, со свойственными им позитивной энергетикой и оптимистичным взглядом на жизнь приглашают зрителей посмотреть лучшие концертные номера и послушать любимые песни."
                },
                {
                    "title": "Специальный корреспондент",
                    "time": "09:45",
                    "category": "Инфо",
                    "description": "Популярная публицистическая программа, которая выходит с сентября 2002 года. Каждую неделю один из ведущих рассказывает в своем фильме-репортаже о какой-либо актуальной проблеме, существующей в современном обществе, посвящает зрительскую аудиторию в подробности наиболее значимых для страны и мира событий."
                },
                {
                    "title": "Местное время. Вести-Москва. Неделя в городе",
                    "time": "10:20",
                    "category": "Инфо",
                    "description": "Новости, происшествия, репортажи - все, что произошло в столице за неделю."
                },
                {
                    "title": "Позови, и я приду",
                    "time": "13:10",
                    "category": "Фильмы",
                    "description": "Своенравный характер и подростковая страсть приводят главную героиню к печальным последствиям - она слишком рано становится матерью и вынуждена оставить сына в детском доме. Встав на ноги, девушка не может смириться с принятым ранее решением и всеми силами пытается разыскать своего ребенка."
                },
                {
                    "title": "Вести",
                    "time": "14:00",
                    "category": "Инфо",
                    "description": "13 мая 1991 года первым выпуском информационной программы \"Вести\" началась история телеканала \"Россия\". \"Вести\", которые можно смело назвать главной информационной программой страны, всегда являлись визитной карточкой телеканала."
                },
                {
                    "title": "По горячим следам",
                    "time": "15:00",
                    "category": "Сериалы",
                    "description": "В полицию обращается женщина - пропал ее сын, 18-летний Петя. Пропал из больницы, в которую попал несколько часов назад с черепно-мозговой травмой. Врач сказал матери, что, по словам свидетелей, Петя ехал на футбольный матч в компании фанатов и подрался с фанатами команды-соперника..."
                },
                {
                    "title": "Личный интерес",
                    "time": "16:10",
                    "category": "Сериалы",
                    "description": "Татьяна убегает из зоны, она приезжает в глухое село Павловка - в дом своей покойной бабушки. Там она встречает Максима, который приехал в деревню, чтобы отдохнуть от городской суеты. Между ними возникает взаимное чувство."
                }
                ,
                {
                    "title": "Один в один. Битва сезонов",
                    "time": "17:20",
                    "category": "Досуг",
                    "description": "В новом сезоне шоу встречаются победители и финалисты всех предыдущих сезонов! Каждую неделю десять знаменитостей примеряют на себя образ легендарных музыкантов прошлого и настоящего, полностью копируя оригинальный стиль артиста: от манеры двигаться до тембра голоса."
                }
            ]
        },
        {
            "title": "ТВ Центр",
            "image": "images/tvc",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Доктор И...",
                    "category": "Досуг",
                    "description": "Вести здоровый образ жизни - это не только правильно, но и модно. Прекрасно выглядеть научит новое ток-шоу"
                },
                {
                    "time": "10:55",
                    "title": "Отец Браун. Сезон 2. 3-я серия",
                    "category": "Сериалы",
                    "description": "Отец Браун приглашен к Шарлотте МакКенли. Она уверена, что ее посещает привидение сестры Элспид, пропавшей девять лет назад. Но, неожиданно, исчезает сама Шарлотта, мирно читавшая книгу в своей комнате."
                },
                {
                    "time": "11:55",
                    "title": "Отец Браун. Сезон 2. 4-я серия",
                    "category": "Сериалы",
                    "description": "Отец Браун приглашен к Шарлотте МакКенли. Она уверена, что ее посещает привидение сестры Элспид, пропавшей девять лет назад. Но, неожиданно, исчезает сама Шарлотта, мирно читавшая книгу в своей комнате."
                },
                {
                    "time": "12:55",
                    "title": "Барышня и кулинар",
                    "category": "Досуг",
                    "description": "Кулинарная программа с участием двух постоянных ведущих. Опытный кулинар Михаил Плотников еженедельно дает уроки приготовления вкусной и здоровой пищи своей ученице - Анне Семенович."
                },
                {
                    "time": "14:00",
                    "title": "События",
                    "category": "Инфо",
                    "description": "Основная ежедневная информационная программа канала, посвященная важнейшим общественным, политическим, экономическим и культурным событиям дня в России и за рубежом."
                },
                {
                    "time": "14:45",
                    "title": "Петровка, 38",
                    "category": "Инфо",
                    "description": "Ежедневная телепрограмма, подготовленная телестудией ГУВД Москвы. В программе даётся оперативная сводка происшествий по городу."
                },
                {
                    "time": "15:55",
                    "title": "Смех с доставкой на дом",
                    "category": "Досуг",
                    "description": "Смех с доставкой на дом."
                },
                {
                    "time": "16:00",
                    "title": "Московская неделя",
                    "category": "Сериалы",
                    "description": "Ттележурнал о нашем городе, о людях, которые в нем живут, и о наиболее заметных событиях прошедших семи дней. Все грани столичной жизни: от экономики и градостроительства - до истории, культуры и даже московских тайн."
                }
            ]
        },
        {
            "title": "Матч ТВ",
            "image": "images/match_tv",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Ты можешь больше!",
                    "category": "Досуг",
                    "description": "Это не программа про скучный спортзал и строгую диету. Вы научитесь правильно питаться и заниматься зарядкой так, как никто и никогда этого не делал. Образ жизни начинается с мыслей - а они должны быть позитивными! Каждый человек должен начать путь с дивана в активную жизнь. Наши ведущие: Маша Командная, Сергей Кривохарченко, Алексей Михайлов, Ольга Березуцкая, эксперты и гости помогут сделать жизнь лучше, ну или, хотя бы - веселее! Зарядки, вкусные и полезные блюда, правила спорта и мотивирующие истории наших героев - все это - \"Ты можешь больше!\""
                },
                {
                    "time": "10:05",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "14:00",
                    "title": "Где рождаются чемпионы?",
                    "category": "Спорт",
                    "description": "Где рождаются чемпионы?"
                },
                {
                    "time": "12:30",
                    "title": "Все на \"Матч\"!",
                    "category": "Спорт",
                    "description": "Звезды российского спорта в гостях у звезд телеканала \"Матч ТВ\" на премьере новой ежедневной программы! Все главные события - в диалогах и репортажах со всего мира. Эксклюзивные интервью и ключевые моменты соревнований, свежие новости и глубокая аналитика от лучших спортивных экспертов."
                },
                {
                    "time": "14:00",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "14:30",
                    "title": "Смешанные единоборства. UFC",
                    "category": "Спорт",
                    "description": "Смешанные единоборства. UFC"
                },
                {
                    "time": "17:50",
                    "title": "Континентальный вечер",
                    "category": "Спорт",
                    "description": "Континентальный вечер"
                },
                {
                    "time": "18:50",
                    "title": "Лицом к лицу. Словакия",
                    "category": "Спорт",
                    "description": "Лицом к лицу. Словакия"
                }
            ]
        },
        {
            "title": "Пятница",
            "image": "images/pyatnica",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Вуди Вудпекер",
                    "category": "Детям",
                    "description": "Обновленная версия приключений неутомимого дятла Вуди. Недаром Вуди называют американским дятлом номер один. Песня из мультфильма про этого дятла возглавила хит-парады аж в 48-м году, а его смех до сих пор является фирменной маркой американской мультипликации."
                },
                {
                    "time": "09:05",
                    "title": "Смешарики",
                    "category": "Детям",
                    "description": "На планете Земля существует вымышленная страна, где живут забавные круглые зверушки. Здесь новый день не похож на предыдущий, обитатели чудесного места постоянно придумывают себе захватывающие приключения."
                },
                {
                    "time": "10:55",
                    "title": "Школа",
                    "category": "Досуг",
                    "description": "Он действительно доктор, а не шоумен в белом халате! Он реально рассказывает, как сохранить здоровье наших любимых, а не устраивает клоунаду перед камерой."
                },
                {
                    "time": "12:30",
                    "title": "Блокбастеры!",
                    "category": "Досуг",
                    "description": "Андрей Бедняков и Настя Короткая приглашают вас в невероятное путешествие по местам любимых фильмов. Оказавшись в роли известных киногероев, они повторят их маршруты, узнают секреты съемок и покажут, что изменилось с тех пор, как в этих местах прозвучала команда Стоп, снято!"
                },
                {
                    "time": "14:00",
                    "title": "Орел и решка. Кругосветка",
                    "category": "Досуг",
                    "description": "Регина Тодоренко и Леся Никитюк отправляются в самое захватывающее путешествие - в кругосветку. Две блондинки, девять месяцев непрерывного путешествия и миллион всего, ради чего стоит путешествовать."
                },
                {
                    "time": "15:30",
                    "title": "Сверхъестественное",
                    "category": "Сериалы",
                    "description": "Сериал рассказывает о приключениях братьев Сэма и Дина Винчестеров, которые путешествуют по Соединенным Штатам, расследуют паранормальные явления, многие из которых основаны на американских городских легендах и фольклоре, и сражаются с порождениями зла, такими как демоны и призраки."
                },
                {
                    "time": "16:30",
                    "title": "Сверхъестественное",
                    "category": "Сериалы",
                    "description": "Сериал рассказывает о приключениях братьев Сэма и Дина Винчестеров, которые путешествуют по Соединенным Штатам, расследуют паранормальные явления, многие из которых основаны на американских городских легендах и фольклоре, и сражаются с порождениями зла, такими как демоны и призраки."
                },
                {
                    "time": "19:50",
                    "title": "Двойник",
                    "category": "Сериалы",
                    "description": "В центре истории - молодая женщина, у которой куча проблем, да еще и приходится скрываться от мафии. Она решает притвориться своей богатой сестрой-близняшкой и узнает, что за той тоже идет охота."
                }
            ]
        }
        
        
    ];

var sundayTVProgramm = new TVProgramm();
sundayTVProgramm.channels = 
    [
        {
            "title": "Первый",
            "image": "images/1_kanal",
            "programms": [
                        {
                            "title": "Телеканал Доброе утро",
                            "time": "8:00",
                            "category": "Досуг",
                            "description": "Утренний информационно-развлекательный телеканал появился в 1986 году."
                        }, 
                        {
                            "title": "Новости",
                            "time": "9:00",
                            "category": "Инфо",
                            "description": "Новости"
                        }, 
                        {
                            "title": "Контрольная закупка",
                            "time": "9:30",
                            "category": "Досуг",
                            "description": "Программа основана на конкурсе товаров с объявлением победителя.  Новые рубрики: Контрольный рейд - основная задача  - узнать, какие продукты продаются на прилавках рынков и магазинов, с какими проблемами сталкивается рядовой покупатель, и научить продавца соблюдать законы."
                        }, 
                        {
                            "title": "Жить здорово!",
                            "time": "10:20",
                            "category": "Досуг",
                            "description": "Жить здорово!"
                        }, 
                        {
                            "title": "Модный приговор",
                            "time": "11:20",
                            "category": "Досуг",
                            "description": "Модный приговор"
                        }, 
                        {
                            "title": "Новости с субтитрами",
                            "time": "13:00",
                            "category": "Инфо",
                            "description": "Новости с субтитрами"
                        }, 
                        {
                            "title": "Пусть говорят",
                            "time": "13:40",
                            "category": "Досуг",
                            "description": "Пусть говорят"
                        }, 
                        {
                            "title": "Новости с субтитрами",
                            "time": "17:00",
                            "category": "Инфо",
                            "description": "Новости с субтитрами"
                        }, 
                        {
                            "title": "Время покажет",
                            "time": "18:00",
                            "category": "Досуг",
                            "description": "Время покажет"
                        }, 
                        {
                            "title": "Мужское / Женское",
                            "time": "19:00",
                            "category": "Досуг",
                            "description": "Проект, который попытается помочь мужчинам и женщинам разобраться в их отношениях."
                        }, 
                        {
                            "title": "Наедине со всеми",
                            "time": "20:10",
                            "category": "Досуг",
                            "description": "Программа-интервью с известными людьми."
                        }, 
                        {
                            "title": "Вечерние новости с субтитрами",
                            "time": "21:00",
                            "category": "Инфо",
                            "description": "Вечерние новости с субтитрами"
                        }
                    ]
        },
        {
            "title": "Россия 1",
            "image": "images/russia_1",
            "programms": [
                {
                    "title": "Специальный корреспондент",
                    "time": "07:45",
                    "category": "Инфо",
                    "description": "Популярная публицистическая программа, которая выходит с сентября 2002 года. Каждую неделю один из ведущих рассказывает в своем фильме-репортаже о какой-либо актуальной проблеме, существующей в современном обществе, посвящает зрительскую аудиторию в подробности наиболее значимых для страны и мира событий."
                },
                {
                    "title": "Утро России",
                    "time": "08:20",
                    "category": "Досуг",
                    "description": "Утро России"
                },
                {
                    "title": "Утренняя почта",
                    "time": "08:50",
                    "category": "Досуг",
                    "description": "Артисты разговорного жанра, известные юмористы братья Пономаренко, со свойственными им позитивной энергетикой и оптимистичным взглядом на жизнь приглашают зрителей посмотреть лучшие концертные номера и послушать любимые песни."
                },
                {
                    "title": "Местное время. Вести-Москва. Неделя в городе",
                    "time": "10:20",
                    "category": "Инфо",
                    "description": "Новости, происшествия, репортажи - все, что произошло в столице за неделю."
                },
                {
                    "title": "Позови, и я приду",
                    "time": "13:10",
                    "category": "Фильмы",
                    "description": "Своенравный характер и подростковая страсть приводят главную героиню к печальным последствиям - она слишком рано становится матерью и вынуждена оставить сына в детском доме. Встав на ноги, девушка не может смириться с принятым ранее решением и всеми силами пытается разыскать своего ребенка."
                },
                {
                    "title": "Вести",
                    "time": "14:00",
                    "category": "Инфо",
                    "description": "13 мая 1991 года первым выпуском информационной программы \"Вести\" началась история телеканала \"Россия\". \"Вести\", которые можно смело назвать главной информационной программой страны, всегда являлись визитной карточкой телеканала."
                },
                {
                    "title": "По горячим следам",
                    "time": "15:00",
                    "category": "Сериалы",
                    "description": "В полицию обращается женщина - пропал ее сын, 18-летний Петя. Пропал из больницы, в которую попал несколько часов назад с черепно-мозговой травмой. Врач сказал матери, что, по словам свидетелей, Петя ехал на футбольный матч в компании фанатов и подрался с фанатами команды-соперника..."
                },
                {
                    "title": "Личный интерес",
                    "time": "16:10",
                    "category": "Сериалы",
                    "description": "Татьяна убегает из зоны, она приезжает в глухое село Павловка - в дом своей покойной бабушки. Там она встречает Максима, который приехал в деревню, чтобы отдохнуть от городской суеты. Между ними возникает взаимное чувство."
                }
                ,
                {
                    "title": "Один в один. Битва сезонов",
                    "time": "17:20",
                    "category": "Досуг",
                    "description": "В новом сезоне шоу встречаются победители и финалисты всех предыдущих сезонов! Каждую неделю десять знаменитостей примеряют на себя образ легендарных музыкантов прошлого и настоящего, полностью копируя оригинальный стиль артиста: от манеры двигаться до тембра голоса."
                }
            ]
        },
        {
            "title": "ТВ Центр",
            "image": "images/tvc",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Доктор И...",
                    "category": "Досуг",
                    "description": "Вести здоровый образ жизни - это не только правильно, но и модно. Прекрасно выглядеть научит новое ток-шоу"
                },
                {
                    "time": "10:55",
                    "title": "Отец Браун. Сезон 2. 5-я серия",
                    "category": "Сериалы",
                    "description": "Отец Браун приглашен к Шарлотте МакКенли. Она уверена, что ее посещает привидение сестры Элспид, пропавшей девять лет назад. Но, неожиданно, исчезает сама Шарлотта, мирно читавшая книгу в своей комнате."
                },
                {
                    "time": "11:55",
                    "title": "Отец Браун. Сезон 2. 6-я серия",
                    "category": "Сериалы",
                    "description": "Отец Браун приглашен к Шарлотте МакКенли. Она уверена, что ее посещает привидение сестры Элспид, пропавшей девять лет назад. Но, неожиданно, исчезает сама Шарлотта, мирно читавшая книгу в своей комнате."
                },
                {
                    "time": "13:00",
                    "title": "События",
                    "category": "Инфо",
                    "description": "Основная ежедневная информационная программа канала, посвященная важнейшим общественным, политическим, экономическим и культурным событиям дня в России и за рубежом."
                },
                {
                    "time": "13:45",
                    "title": "Петровка, 38",
                    "category": "Инфо",
                    "description": "Ежедневная телепрограмма, подготовленная телестудией ГУВД Москвы. В программе даётся оперативная сводка происшествий по городу."
                },
                {
                    "time": "14:15",
                    "title": "Смех с доставкой на дом",
                    "category": "Досуг",
                    "description": "Смех с доставкой на дом."
                },
                {
                    "time": "14:30",
                    "title": "Московская неделя",
                    "category": "Сериалы",
                    "description": "Тележурнал о нашем городе, о людях, которые в нем живут, и о наиболее заметных событиях прошедших семи дней. Все грани столичной жизни: от экономики и градостроительства - до истории, культуры и даже московских тайн."
                },
                {
                    "time": "15:00",
                    "title": "Каменская (Игра на чужом поле)",
                    "category": "Инфо",
                    "description": "Получив отпуск, Настя уезжает в санаторий \"Долина\", где попадает в гущу криминальных событий. В курортном городке работает подпольная киностудия, где снимают странные фильмы с кровавыми сюжетами. А потом начинаются самые что ни на есть реальные убийства."
                }
                ,
                {
                    "time": "17:10",
                    "title": "Марафон для трех граций",
                    "category": "Фильмы",
                    "description": "Встретившись в кафе, подруги Катя, Жанна и Ирина обращают внимание на странную пару за соседним столом: женщина тайно передает мужчине конверт. А несколько минут спустя они видят в туалете на полу того самого мужчину застреленным."
                }
            ]
        },
        {
            "title": "Матч ТВ",
            "image": "images/match_tv",
            "programms": [
                {
                    "time": "08:10",
                    "title": "Ты можешь больше!",
                    "category": "Досуг",
                    "description": "Это не программа про скучный спортзал и строгую диету. Вы научитесь правильно питаться и заниматься зарядкой так, как никто и никогда этого не делал. Образ жизни начинается с мыслей - а они должны быть позитивными! Каждый человек должен начать путь с дивана в активную жизнь. Наши ведущие: Маша Командная, Сергей Кривохарченко, Алексей Михайлов, Ольга Березуцкая, эксперты и гости помогут сделать жизнь лучше, ну или, хотя бы - веселее! Зарядки, вкусные и полезные блюда, правила спорта и мотивирующие истории наших героев - все это - \"Ты можешь больше!\""
                },
                {
                    "time": "10:05",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                },
                {
                    "time": "11:30",
                    "title": "Смешанные единоборства. UFC",
                    "category": "Спорт",
                    "description": "Смешанные единоборства. UFC"
                },
                {
                    "time": "12:30",
                    "title": "Континентальный день",
                    "category": "Спорт",
                    "description": "Континентальный день"
                },
                {
                    "time": "14:50",
                    "title": "Обзор Лиги чемпионов",
                    "category": "Спорт",
                    "description": "Обзор Лиги чемпионов"
                },
                {
                    "time": "16:50",
                    "title": "Тяжелая атлетика. Чемпионат Европы. Трансляция из Норвегии",
                    "category": "Спорт",
                    "description": "Тяжелая атлетика. Чемпионат Европы. Трансляция из Норвегии"
                },
                {
                    "time": "18:05",
                    "title": "Новости",
                    "category": "Инфо",
                    "description": "О политике, экономике, общественной жизни, культуре, спорте."
                }
            ]
        },
        {
            "title": "Пятница",
            "image": "images/pyatnica",
            "programms": [
                {
                    "time": "07:55",
                    "title": "Школа доктора Комаровского. Классный журнал",
                    "category": "Досуг",
                    "description": "Он действительно доктор, а не шоумен в белом халате! Он реально рассказывает, как сохранить здоровье наших любимых, а не устраивает клоунаду перед камерой."
                },
                {
                    "time": "09:30",
                    "title": "Блокбастеры!",
                    "category": "Досуг",
                    "description": "Андрей Бедняков и Настя Короткая приглашают вас в невероятное путешествие по местам любимых фильмов. Оказавшись в роли известных киногероев, они повторят их маршруты, узнают секреты съемок и покажут, что изменилось с тех пор, как в этих местах прозвучала команда Стоп, снято!"
                },
                {
                    "time": "10:10",
                    "title": "Вуди Вудпекер",
                    "category": "Детям",
                    "description": "Обновленная версия приключений неутомимого дятла Вуди. Недаром Вуди называют американским дятлом номер один. Песня из мультфильма про этого дятла возглавила хит-парады аж в 48-м году, а его смех до сих пор является фирменной маркой американской мультипликации."
                },
                {
                    "time": "11:00",
                    "title": "Смешарики",
                    "category": "Детям",
                    "description": "На планете Земля существует вымышленная страна, где живут забавные круглые зверушки. Здесь новый день не похож на предыдущий, обитатели чудесного места постоянно придумывают себе захватывающие приключения."
                },
                {
                    "time": "14:00",
                    "title": "Орел и решка. Кругосветка",
                    "category": "Досуг",
                    "description": "Регина Тодоренко и Леся Никитюк отправляются в самое захватывающее путешествие - в кругосветку. Две блондинки, девять месяцев непрерывного путешествия и миллион всего, ради чего стоит путешествовать."
                },
                {
                    "time": "15:30",
                    "title": "Поймай меня, если сможешь",
                    "category": "Фильмы",
                    "description": "Фрэнк Эбэгнейл успел поработать врачом, адвокатом и пилотом на пассажирской авиалинии – и все это до достижения полного совершеннолетия в 21 год. Мастер в обмане и жульничестве, он также обладал искусством подделки документов, что в конечном счете принесло ему миллионы долларов, которые он получил по фальшивым чекам."
                }
            ]
        }
    ];